/**
 * Created by R on 2017/8/18.
 */
var Canvas = {
    color:[
        '#FFB6C1',
        '#FFC0CB',
        '#DC143C',
        '#FFF0F5',
        '#DB7093',
        '#FF69B4',
        '#FF1493',
        '#C71585',
        '#DA70D6',
        '#D8BFD8',
        '#DDA0DD',
        '#EE82EE',
        '#FF00FF',
        '#FF00FF',
        '#8B008B',
        '#800080',
        '#BA55D3',
        '#9400D3',
        '#9932CC',
        '#4B0082',
        '#8A2BE2',
        '#9370DB',
        '#7B68EE',
        '#6A5ACD',
        '#483D8B',
        '#E6E6FA',
        '#F8F8FF',
        '#0000FF',
        '#0000CD',
        '#191970',
        '#00008B',
        '#000080',
        '#4169E1',
        '#6495ED',
        '#B0C4DE',
        '#778899',
        '#708090',
        '#1E90FF',
        '#F0F8FF',
        '#4682B4',
        '#87CEFA',
        '#87CEEB',
        '#00BFFF',
        '#ADD8E6',
        '#B0E0E6',
        '#5F9EA0',
        '#F0FFFF',
        '#E1FFFF',
        '#AFEEEE',
        '#00FFFF',
        '#00FFFF',
        '#00CED1',
        '#2F4F4F',
        '#008B8B',
        '#008080',
        '#48D1CC',
        '#20B2AA',
        '#40E0D0',
        '#7FFFAA',
        '#00FA9A',
        '#F5FFFA',
        '#00FF7F',
        '#3CB371',
        '#2E8B57',
        '#F0FFF0',
        '#90EE90',
        '#98FB98',
        '#8FBC8F',
        '#32CD32',
        '#00FF00',
        '#228B22',
        '#008000',
        '#006400',
        '#7FFF00',
        '#7CFC00',
        '#ADFF2F',
        '#556B2F',
        '#6B8E23',
        '#FAFAD2',
        '#FFFFF0',
        '#FFFFE0',
        '#FFFF00',
        '#808000',
        '#BDB76B',
        '#FFFACD',
        '#EEE8AA',
        '#F0E68C',
        '#FFD700',
        '#FFF8DC',
        '#DAA520',
        '#FFFAF0',
        '#FDF5E6',
        '#F5DEB3',
        '#FFE4B5',
        '#FFA500',
        '#FFEFD5',
        '#FFEBCD',
        '#FFDEAD',
        '#FAEBD7',
        '#D2B48C',
        '#DEB887',
        '#FFE4C4',
        '#FF8C00',
        '#FAF0E6',
        '#CD853F',
        '#FFDAB9',
        '#F4A460',
        '#D2691E',
        '#8B4513',
        '#FFF5EE',
        '#A0522D',
        '#FFA07A',
        '#FF7F50',
        '#FF4500',
        '#E9967A',
        '#FF6347',
        '#FFE4E1',
        '#FA8072',
        '#FFFAFA',
        '#F08080',
        '#BC8F8F',
        '#CD5C5C',
        '#FF0000',
        '#A52A2A',
        '#B22222',
        '#8B0000',
        '#800000',
        '#FFFFFF',
        '#F5F5F5',
        '#DCDCDC',
        '#D3D3D3',
        '#C0C0C0',
        '#A9A9A9',
        '#808080',
        '#696969',
        '#000000',
    ],
    init: function () {
        var canvas = document.getElementById('canvas');
        this.ctx = canvas.getContext('2d');//画笔 创建2d绘画空间
        canvas.width = window.innerWidth;
        canvas.height = window.innerHeight;
        this.letters = 'ぁあぃいぅうぇえぉおかがきぎくぐけげこごさざしじすずせぜそぞただちぢっつづてでとどなにぬねのはばぱひびぴふぶぷへべぺほぼぽまみむめもゃやゅゆょよらりるれろゎわゐゑをんゔゕゖァアィイゥウェエォオカガキギクグケゲコゴサザシジスズセゼソゾタダチヂッツヅテデトドナニヌネノハバパヒビピフブプヘベペホボポマミムメモャヤュユョヨラリルレロヮワヰヱヲンヴヵヶヷヸヹヺ・ーヽヾヿ゠ㇰㇱㇲㇳㇴㇵㇶㇷㇸㇹㇺㇻㇼㇽㇾㇿ─ ━│┃╌╍╎╏┄ ┅┆┇┈ ┉┊┋┌┍┎┏┐┑┒┓└ ┕┖┗ ┘┙┚┛├┝┞┟┠┡┢┣ ┤┥┦┧┨┩┪┫┬ ┭ ┮ ┯ ┰ ┱ ┲ ┳ ┴ ┵ ┶ ┷ ┸ ┹ ┺ ┻┼ ┽ ┾ ┿ ╀ ╁ ╂ ╃ ╄ ╅ ╆ ╇ ╈ ╉ ╊ ╋ ╪ ╫ ╬═║╒╓╔ ╕╖╗╘╙╚ ╛╜╝╞╟╠ ╡╢╣╤ ╥ ╦ ╧ ╨ ╩ ╳╔ ╗╝╚ ╬ ═ ╓ ╩ ┠ ┨┯ ┷┏ ┓┗ ┛┳ ⊥ ﹃ ﹄┌ ╮ ╭ ╯╰ABCDEFGHIJKLMNOPQRSTUVWXYZ1234567890abcdefghijklmnopqrstuvwxyz!@#$%^&*()_+.{}[]/:' +
            '✐✎✏✑✒✍✉✁✂✃✄✆✉☎☏☑✓✔√☐☒✗✘ㄨ✕✖✖☢☠☣✈★☆✡囍㍿☯☰☲☱☴☵☶☳☷☜☞☝✍☚☛☟✌♤♧♡♢♠♣♥♦☀☁☂❄☃♨웃유❖☽☾☪✿♂♀✪✯☭➳卍卐√×■◆●○◐◑✙☺☻❀⚘♔♕♖♗♘♙♚♛♜♝♞♟♧♡♂♀♠♣♥❤☜☞☎☏⊙◎☺☻☼▧▨♨◐◑↔↕▪▒◊◦▣▤▥▦▩◘◈◇♬♪♩♭♪の★☆→あぃ￡Ю〓§♤♥▶¤✲❈✿✲❈➹☀☂☁【】┱┲❣✚✪✣✤✥✦❉❥❦❧❃❂❁❀✄☪☣☢☠☭ღ▶▷◀◁☀☁☂☃☄★☆☇☈⊙☊☋☌☍ⓛⓞⓥⓔ╬『』∴☀♫♬♩♭♪☆∷﹌の★◎▶☺☻►◄▧▨♨◐◑↔↕↘▀▄█▌◦☼♪の☆→♧ぃ￡❤▒▬♦◊◦♠♣▣۰•❤•۰►◄▧▨♨◐◑↔↕▪▫☼♦⊙●○①⊕◎Θ⊙¤㊣★☆♀◆◇◣◢◥▲▼△▽⊿◤◥✐✌✍✡✓✔✕✖♂♀♥♡☜☞☎☏⊙◎☺☻►◄▧▨♨◐◑↔↕♥♡▪▫☼♦▀▄█▌▐░▒▬♦◊◘◙◦☼♠♣▣▤▥▦▩◘◙◈♫♬♪♩♭♪✄☪☣☢☠♯♩♪♫♬♭♮☎☏☪♈ºº₪¤큐«»™♂✿♥　◕‿-｡　｡◕‿◕｡❤❥웃유♋☮✌☏☢☠✔☑♚▲♪✈✞÷↑↓◆◇⊙■□△▽¿─│♥❣♂♀☿Ⓐ✍✉☣☤✘☒♛▼♫⌘☪≈←→◈◎☉★☆⊿※¡━┃♡ღツ☼☁❅♒✎©®™Σ✪✯☭➳卐√↖↗●◐Θ◤◥︻〖〗┄┆℃℉°✿ϟ☃☂✄¢€£∞✫★½✡×↙↘○◑⊕◣◢︼【】┅┇☽☾✚〓▂▃▄▅▆▇█▉▊▋▌▍▎▏↔↕☽☾の•▸◂▴▾┈┊①②③④⑤⑥⑦⑧⑨⑩ⅠⅡⅢⅣⅤⅥⅦⅧⅨⅩ㍿▓♨♛❖♓☪✙┉┋☹☺☻تヅツッシÜϡﭢ™℠℗©®♥❤❥❣❦❧♡۵웃유ღ♋♂♀☿☼☀☁☂☄☾☽❄☃☈⊙☉℃℉❅✺ϟ☇♤♧♡♢♠♣♥♦☜☞☝✍☚☛☟✌✽✾✿❁❃❋❀⚘☑✓✔√☐☒✗✘ㄨ✕✖✖⋆✢✣✤✥❋✦✧✩✰✪✫✬✭✮✯❂✡★✱✲✳✴✵✶✷✸✹✺✻✼❄❅❆❇❈❉❊†☨✞✝☥☦☓☩☯☧☬☸✡♁✙♆。，、＇：∶；?‘’“”〝〞ˆˇ﹕︰﹔﹖﹑•¨….¸;！´？！～—ˉ｜‖＂〃｀@﹫¡¿﹏﹋﹌︴々﹟#﹩$﹠&﹪%*﹡﹢﹦﹤‐￣¯―﹨ˆ˜﹍﹎+=<＿_-\\ˇ~﹉﹊（）〈〉‹›﹛﹜『』〖〗［］《》〔〕{}「」【】︵︷︿︹︽_﹁﹃︻︶︸﹀︺︾ˉ﹂﹄︼☩☨☦✞✛✜✝✙✠✚†‡◉○◌◍◎●◐◑◒◓◔◕◖◗❂☢⊗⊙◘◙◍⅟½⅓⅕⅙⅛⅔⅖⅚⅜¾⅗⅝⅞⅘≂≃≄≅≆≇≈≉≊≋≌≍≎≏≐≑≒≓≔≕≖≗≘≙≚≛≜≝≞≟≠≡≢≣≤≥≦≧≨≩⊰⊱⋛⋚∫∬∭∮∯∰∱∲∳%℅‰‱㊣㊎㊍㊌㊋㊏㊐㊊㊚㊛㊤㊥㊦㊧㊨㊒㊞㊑㊒㊓㊔㊕㊖㊗㊘㊜㊝㊟㊠㊡㊢㊩㊪㊫㊬㊭㊮㊯㊰㊙㉿囍♔♕♖♗♘♙♚♛♜♝♞♟ℂℍℕℙℚℝℤℬℰℯℱℊℋℎℐℒℓℳℴ℘ℛℭ℮ℌℑℜℨ♪♫♩♬♭♮♯°øⒶ☮✌☪✡☭✯卐✐✎✏✑✒✍✉✁✂✃✄✆✉☎☏➟➡➢➣➤➥➦➧➨➚➘➙➛➜➝➞➸♐➲➳⏎➴➵➶➷➸➹➺➻➼➽←↑→↓↔↕↖↗↘↙↚↛↜↝↞↟↠↡↢↣↤↥↦↧↨➫➬➩➪➭➮➯➱↩↪↫↬↭↮↯↰↱↲↳↴↵↶↷↸↹↺↻↼↽↾↿⇀⇁⇂⇃⇄⇅⇆⇇⇈⇉⇊⇋⇌⇍⇎⇏⇐⇑⇒⇓⇔⇕⇖⇗⇘⇙⇚⇛⇜⇝⇞⇟⇠⇡⇢⇣⇤⇥⇦⇧⇨⇩⇪➀➁➂➃➄➅➆➇➈➉➊➋➌➍➎➏➐➑➒➓㊀㊁㊂㊃㊄㊅㊆㊇㊈㊉ⒶⒷⒸⒹⒺⒻⒼⒽⒾⒿⓀⓁⓂⓃⓄⓅⓆⓇⓈⓉⓊⓋⓌⓍⓎⓏⓐⓑⓒⓓⓔⓕⓖⓗⓘⓙⓚⓛⓜⓝⓞⓟⓠⓡⓢⓣⓤⓥⓦⓧⓨⓩ⒜⒝⒞⒟⒠⒡⒢⒣⒤⒥⒦⒧⒨⒩⒪⒫⒬⒭⒮⒯⒰⒱⒲⒳⒴⒵ⅠⅡⅢⅣⅤⅥⅦⅧⅨⅩⅪⅫⅬⅭⅮⅯⅰⅱⅲⅳⅴⅵⅶⅷⅸⅹⅺⅻⅼⅽⅾⅿ┌┍┎┏┐┑┒┓└┕┖┗┘┙┚┛├┝┞┟┠┡┢┣┤┥┦┧┨┩┪┫┬┭┮┯┰┱┲┳┴┵┶┷┸┹┺┻┼┽┾┿╀╁╂╃╄╅╆╇╈╉╊╋╌╍╎╏═║╒╓╔╕╖╗╘╙╚╛╜╝╞╟╠╡╢╣╤╥╦╧╨╩╪╫╬◤◥◄►▶◀◣◢▲▼◥▸◂▴▾△▽▷◁⊿▻◅▵▿▹◃❏❐❑❒▀▁▂▃▄▅▆▇▉▊▋█▌▍▎▏▐░▒▓▔▕■□▢▣▤▥▦▧▨▩▪▫▬▭▮▯㋀㋁㋂㋃㋄㋅㋆㋇㋈㋉㋊㋋㏠㏡㏢㏣㏤㏥㏦㏧㏨㏩㏪㏫㏬㏭㏮㏯㏰㏱㏲㏳㏴㏵㏶㏷㏸㏹㏺㏻㏼㏽㏾㍙㍚㍛㍜㍝㍞㍟㍠㍡㍢㍣㍤㍥㍦㍧㍨㍩㍪㍫㍬㍭㍮㍯㍰㍘☰☲☱☴☵☶☳☷;';
        this.cw = canvas.width;
        this.ch = canvas.height;
        this.list = [];
    },
    run: function () {
        var l = this.letters.length;
        var par = {
            x: this.cw / 2,
            y: this.ch,
            character: this.letters[Math.floor(Math.random() * l)],//随机获取字母
            xSpeed: (Math.random() * 20) - 10,
            ySPeed: (Math.random() * 20) - 10,
            color:this.color[Math.round(Math.random()*this.color.length)]
        };
        this.list.push(par);
        this.draw();
    },
    draw: function () {
        var l = this.list.length;
        var c = this.ctx;
        for (var i = 0; i < l; i++) {
            var lists = this.list[i];
            c.font = '12px sans-serif';
            c.fillStyle = lists.color;
            c.fillText(lists.character, lists.x, lists.y);
            lists.x += lists.xSpeed;
            lists.y += lists.ySPeed;
            lists.y *= 0.98;
        }
        this.fadeCanvas();
    },
    fadeCanvas: function () {
        this.ctx.fillStyle = 'rgba(0,0,0,0.5)';
        this.ctx.fillRect(0, 0, this.cw, this.ch)
    }
};
Canvas.init();
setInterval(function () {
    Canvas.run();
}, 1000 / 60);
